//  const num = 42 // integer
//  const float = 42.42 // float
// const big = 1_000_000 // можно так писать

// Math.pow - метод который возводит в определенную степень
//parseInt - переводит строку в ЦЕЛОЕ число
//parseFloat - переводит строку в число (с учетом значений после запятой)
// + перед строчкой переводит строчку в число
// toFixed - метод количество чисел после запятой, он всегда возсращает строчку!
//Math.sqrt - вычисляет квадратный корень
//Math.max - возвращает максимальное число среди тех, которые мы указали в параметрах: в скобочках- ()
//Math.min - возвращает минимальное число среди тех, которые мы указали в параметрах: в скобочках- ()
//Math.floor - округляет в меньшую сторону
//Math.ceil - округляет в большую сторону
//Math.round - округляет в ближайшее целочисленное значение
//Math.trunc - возвращает целое число
//Math.random - возвращает рандомное число



console.log(Number.MAX_SAFE_INTEGER)
